Revit 2018 API
BasicFileInfo.Extract Method
 Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
public static BasicFileInfo Extract(
	string file
)
Visual Basic
Public Shared Function Extract ( _
	file As String _
) As BasicFileInfo
Visual C++
public:
static BasicFileInfo^ Extract(
	String^ file
)
Parameters
file
Type: System.String
 The full path to the file to be queried, including project (.rvt) and family (.rfa) files.
Return Value
 If successful, basic file data.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.FileArgumentNotFoundException |  The file doesn't exist.
Autodesk.Revit.Exceptions.InvalidOperationException |  A file is saved in very old version of Revit without basic file data.
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace